<?php

#四則演算
//2つの数を作る
$i = random_int(1, 999);
$j = random_int(1, 999);

//加算
$k = $i + $j;
//結果の出力
echo "{$i} + {$j} = {$k} \n";


//減算
$k = $i - $j;
//結果の出力
echo "{$i} - {$j} = {$k} \n";


//乗算
$k = $i * $j;
//結果の出力
echo "{$i} * {$j} = {$k} \n";


//除算
$k = $i / $j;
//結果の出力
echo "{$i} / {$j} = {$j} \n";


//剰余(余りを求める)
$k = $i % $j;
//結果の出力
echo "{$i} % {$j} = {$k} \n";


//冪乗(べき乗)：**を使う書き方
$k = $i ** 3;
//結果の出力
echo "{$i} ** 3 = {$k} \n";


//べき乗：powを使う書き方(PHP5.6以降は上記の**の書き方)
//powを使う書き方はものすごい数字になる
$k = pow($i, 3);
//結果の出力
echo "pow({$i}, 3) = {$k} \n";